# YOLOv8-GhostSeg 配置（scale=n 专用）
nc: 80  # 类别数
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels
  s: [0.33, 0.5, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.0, 1.0, 1024]
  x: [1.0, 1.25, 1024]
# 模型结构（backbone+head 通道全匹配）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0: 64×0.25=16通道, 尺寸640→320
  - [-1, 1, Conv, [128, 3, 2]] # 1: 128×0.25=32通道, 尺寸320→160
  - [-1, 3, C2f, [128, True]]  # 2: 128×0.25=32通道, 尺寸160→160
  # GhostModuleSeg：输入32 → 输出64（64×0.25=16？不！直接写缩放后值）
  - [-1, 1, GhostModuleSeg, [32, 32, 64]]  # 3: 输入32, 输出64（缩放后=64×0.25=16？❌ 直接写实际值）
  # 修正：GhostModuleSeg 直接写缩放后实际通道（禁用自动缩放）
  - [-1, 1, GhostModuleSeg, [32, 32, 64]]  # 3: 输入32（层2输出）→ 输出64（层4输入）
  - [-1, 6, C2f, [256, True]]  # 4: 256×0.25=64通道（匹配层3输出64）
  - [-1, 1, GhostModuleSeg, [64, 64, 128]] # 5: 输入64（层4输出）→ 输出128（层6输入）
  - [-1, 6, C2f, [512, True]]  # 6: 512×0.25=128通道（匹配层5输出128）
  - [-1, 1, GhostModuleSeg, [128, 128, 256]] # 7: 输入128（层6输出）→ 输出256（层8输入）
  - [-1, 3, C2f, [1024, True]] # 8: 1024×0.25=256通道（匹配层7输出256）
  - [-1, 1, SPPF, [1024, 5]]   # 9: 1024×0.25=256通道

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10: 256通道, 尺寸80→160
  - [[-1, 6], 1, Concat, [1]] # 11: 256+128=384→384×0.25=96？❌ 直接匹配
  - [-1, 3, C2f, [512]]        # 12: 512×0.25=128通道

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13: 128通道, 尺寸160→320
  - [[-1, 4], 1, Concat, [1]] # 14: 128+64=192→192×0.25=48？❌ 直接匹配
  - [-1, 3, C2f, [256]]        # 15: 256×0.25=64通道

  - [-1, 1, Conv, [256, 3, 2]] # 16: 256×0.25=64通道, 尺寸320→160
  - [[-1, 12], 1, Concat, [1]] # 17: 64+128=192→192×0.25=48？❌ 直接匹配
  - [-1, 3, C2f, [512]]        # 18: 512×0.25=128通道

  - [-1, 1, Conv, [512, 3, 2]] # 19: 512×0.25=128通道, 尺寸160→80
  - [[-1, 9], 1, Concat, [1]]  # 20: 128+256=384→384×0.25=96？❌ 直接匹配
  - [-1, 3, C2f, [1024]]       # 21: 1024×0.25=256通道

  - [[15, 18, 21], 1, Segment, [nc, 32, 256]] # 22: 分割头，nc=80